tap 'bufbuild/buf'
tap 'cloudflare/cloudflare'
tap 'neilotoole/sq'
tap 'semaphoreci/tap'
tap 'interlynk-io/interlynk'

cask '1password@7'
cask '1password-cli'
cask 'bluesnooze'
cask 'caffeine'
cask 'claude-code'
cask 'codeql'
cask 'docker', args: { appdir: '/Applications' }
cask 'duckduckgo'
cask 'elgato-control-center'
cask 'firefox'
cask 'granola'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'apple-hewlett-packard-printer-drivers'
cask 'iterm2'
cask 'flux-app'
cask 'keybase'
cask 'keycastr'
cask 'linear-linear'
cask 'little-snitch@5'
cask 'maccy'
cask 'micro-snitch'
cask 'mysql'
cask 'notion'
cask 'obsidian'
cask 'rectangle'
cask 'slack'
cask 'superhuman'
cask 'tableplus'
cask 'telegram'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'

brew 'ansible'
brew 'awscli'
brew 'azure-cli'
brew 'bat'
brew 'buf'
brew 'chruby'
brew 'cloudflare/cloudflare/cf-terraforming'
brew 'cmake'
brew 'colima'
brew 'coreutils'
brew 'cowsay'
brew 'curl'
brew' dependabot'
brew 'docker-compose'
brew 'jq'
brew 'gh'
brew 'git'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'go'
brew 'gpg'
brew 'grep'
brew 'htop'
brew 'hub'
brew 'icann-rdap'
brew 'imagemagick'
brew 'interlynk'
brew 'erailed/k9s/k9s'
brew 'kubectl'
brew 'libffi'
brew 'libpq'
brew 'libxslt'
brew 'markdownlint-cli'
brew 'md5sha1sum'
brew 'minikube'
brew 'nomad'
brew 'nvm'
brew 'openssh'
brew 'openssl'
nrew 'pagerduty-cli'
brew 'plantuml'
brew 'postgresql@17'
brew 'pre-commit'
brew 'rclone'
brew 'redis'
brew 'rrdtool'
brew 'ripgrep'
brew 'ruby-install'
brew 'semaphoreci/tap/sem'
brew 'shellcheck'
brew 'sq'
brew 'stow'
brew 'syft'
brew 'tailscale'
brew 'tfenv'
brew 'tflint'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'unzip'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yq'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
