tap 'homebrew/bundle'
tap 'bufbuild/buf'
tap 'neilotoole/sq'

cask '1password@7'
cask '1password-cli'
cask 'bluesnooze'
cask 'caffeine'
cask 'codeql'
cask 'docker', args: { appdir: '/Applications' }
cask 'elgato-control-center'
cask 'firefox'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'apple-hewlett-packard-printer-drivers'
cask 'iterm2'
cask 'flux'
cask 'keycastr'
cask 'little-snitch@5'
cask 'maccy'
cask 'micro-snitch'
cask 'mysql'
cask 'postgresql'
cask 'obsidian'
cask 'rectangle'
cask 'slack'
cask 'tableplus'
cask 'telegram'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

brew 'awscli'
brew 'azure-cli'
brew 'bat'
brew 'buf'
brew 'chruby'
brew 'cmake'
brew 'coreutils'
brew 'cowsay'
brew 'curl'
brew 'docker-compose'
brew 'jq'
brew 'gh'
brew 'git'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'go'
brew 'gpg'
brew 'grep'
brew 'htop'
brew 'hub'
brew 'imagemagick'
brew 'libffi'
brew 'libxslt'
brew 'markdownlint-cli'
brew 'nomad'
brew 'openssh'
brew 'openssl'
brew 'plantuml'
brew 'pre-commit'
brew 'rclone'
brew 'rrdtool'
brew 'ripgrep'
brew 'ruby-install'
brew 'shellcheck'
brew 'sq'
brew 'tailscale'
brew 'tfenv'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'unzip'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yq'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
