tap 'homebrew/bundle'
tap 'bufbuild/buf'

cask '1password-cli'
cask 'bluesnooze'
cask 'caffeine'
cask 'codeql'
cask 'docker', args: { appdir: '/Applications' }
cask 'flux'
cask 'obs'
cask 'omnigraffle'
cask 'rectangle'
cask 'visual-studio-code'
cask 'vlc'

brew 'awscli'
brew 'azure-cli'
brew 'bat'
brew 'buf'
brew 'chruby'
brew 'cmake'
brew 'coreutils'
brew 'cowsay'
brew 'docker-compose'
brew 'curl'
brew 'jq'
brew 'gh'
brew 'git'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'go'
brew 'gpg'
brew 'grep'
brew 'htop'
brew 'hub'
brew 'libffi'
brew 'libxslt'
brew 'maccy'
brew 'markdownlint-cli'
brew 'nomad'
brew 'openssh'
brew 'openssl'
brew 'plantuml'
brew 'pre-commit'
brew 'ruby-install'
brew 'shellcheck'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'unzip'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yq'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
